using System;
using System.Collections.Generic;

namespace RenjuCheckers
{
    public class Output
    {
        // метод, который показывает состояние поля ( то есть выводит матрицу )
        public static void ShowDesk(Desk desk)
        {
            Console.WriteLine();
            Console.WriteLine(desk.Show());
        }

        // метод, который показывает роли игроков ( то есть цвет шашек)
        public static void ShowRole(Dictionary<int, string> players)
        {
            Console.WriteLine(
                $"\n         Игрок {players[1]} - ЧЕРНЫЕ ({(CharactericticsOfTheGame) 1})\n\n         Игрок {players[2]} - БЕЛЫЕ ({(CharactericticsOfTheGame) 2})");
        }

        // метод, который выводит сообщение о победителе
        public static void ShowWinner(int currentMove, Dictionary<int, string> players)
        {
            Console.WriteLine("------------------------------------------------------------------------------------------------------------");
            Console.WriteLine("{1}Ура, ура, у нас есть победитель!\n{1}Поздравляем игрока {2}!\n\r\n{3}████████╗██╗░░██╗░█████╗░███╗░░██╗██╗░░██╗{0}██╗░░░██╗░█████╗░██╗░░░██╗{0}███████╗░█████╗░██████╗░\r\n{3}╚══██╔══╝██║░░██║██╔══██╗████╗░██║██║░██╔╝{0}╚██╗░██╔╝██╔══██╗██║░░░██║{0}██╔════╝██╔══██╗██╔══██╗\r\n{3}░░░██║░░░███████║███████║██╔██╗██║█████═╝░{0}░╚████╔╝░██║░░██║██║░░░██║{0}█████╗░░██║░░██║██████╔╝\r\n{3}░░░██║░░░██╔══██║██╔══██║██║╚████║██╔═██╗░{0}░░╚██╔╝░░██║░░██║██║░░░██║{0}██╔══╝░░██║░░██║██╔══██╗\r\n{3}░░░██║░░░██║░░██║██║░░██║██║░╚███║██║░╚██╗{0}░░░██║░░░╚█████╔╝╚██████╔╝{0}██║░░░░░╚█████╔╝██║░░██║\r\n{3}░░░╚═╝░░░╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░╚══╝╚═╝░░╚═╝{0}░░░╚═╝░░░░╚════╝░░╚═════╝░{0}╚═╝░░░░░░╚════╝░╚═╝░░╚═╝\r\n\r\n{3}██████╗░██╗░░░░░░█████╗░██╗░░░██╗██╗███╗░░██╗░██████╗░██╗\r\n{3}██╔══██╗██║░░░░░██╔══██╗╚██╗░██╔╝██║████╗░██║██╔════╝░██║\r\n{3}██████╔╝██║░░░░░███████║░╚████╔╝░██║██╔██╗██║██║░░██╗░██║\r\n{3}██╔═══╝░██║░░░░░██╔══██║░░╚██╔╝░░██║██║╚████║██║░░╚██╗╚═╝\r\n{3}██║░░░░░███████╗██║░░██║░░░██║░░░██║██║░╚███║╚██████╔╝██╗\r\n{3}╚═╝░░░░░╚══════╝╚═╝░░╚═╝░░░╚═╝░░░╚═╝╚═╝░░╚══╝░╚═════╝░╚═╝", "   ", "                                     ", players[currentMove], "          ");
        }

        //метод, который выводит сообщение о том, что произошла ничья
        public static void ShowDraw()
        {
            Console.WriteLine(
                "\r\n{0}████████    ███              ██████  ███  ████████ \r\n{0}██░░░░░█   █░░█ ██████        █░░░█ ██░█  █░░░░█░█ \r\n{0} ██░░░░██ ██░░░█ █░░░█ ██████ █░░░███░░█ █░░░░██░█ \r\n{0}  ██░░░░█ █░░░░░██░░░██░░░░░░██░░░██░░░██░░░░░█░░█ \r\n{0}   █░░░░░█░░░░░░██░░░█░░████░░█░░░░░░░░░█░░░░██░░█ \r\n{0}   ██░░░░█░░░█░░░█░░░░░██  ██░░░░░░░░░░░░░░░░█░░░█ \r\n{0}    ██░░░░░░░██░░░░░░░░██  ██░░░░░░░██░░░░░░█░░░█ \r\n{0}     █░░░░░░█ ██░░░░█░░░████░░█░░░░███░░░░░░█░░█ \r\n{0}      █░░░░██  ██░░░███░░░░░░█░░░░██  █░░░░█░░█ \r\n{0}       █████    ██████ ██████ █████   ████████ \r\n{0}    █████████████████████████████████████████ \r\n{0}    ██░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░██░░██ \r\n{0}    ██░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█████ \r\n{0}    █████████████████████████████████████\r\n\r\n{1}{0}Игра завершилась НИЧЬЕЙ!",
                "                                     ", "           ");
        }

        public static void ShowLeaderBord(DAO dao)
        {
            try
            {
                var leaderBord = dao.GetLeaderBord();
                Console.WriteLine(leaderBord);
            }
            catch (ExceptionWithLeaderBord e)
            {
                Console.WriteLine(e);
            }
            catch(Exception)
            {
                Console.WriteLine("Упс, произошла непридвиденная ошибка с загрузкой LeaderBord");
            }
        }
    }
}